app/controllers/welcome_controller.rb

  def translate
	@punjabiSentence = params[:punjabiAaala]
	@punjabiWords = @punjabiSentence.strip.split(" ")
	@noOfWords = @punjabiWords.length - 1

	@urduWords = []
       # @urduLetters = []

	for i in 0..@noOfWords
		@urduObj = Translation.where(punjabi: @punjabiWords[i]).first
---
SELECT "translations".* FROM "translations" WHERE "translations"."punjabi" = 'inder' ORDER BY "translations"."id" ASC LIMIT 1